InformationRegisters/ЗапланированныеТО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ЗапланированныеТО</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПробегСледующегоТО</Name>
					<Comment>Пробег следующего ТО</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСледующегоТО</Name>
					<Comment>Предельная дата прохождения следующего техобслуживания</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеИсточника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>270</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗапланированныеТО/Ext/ManagerModule.bsl
// Модуль менеджера регистра "Информация о запланированных ТО"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаполнитьДанныеПоЗапланированнымТО() Экспорт
	
	ФоновыеЗадания.Выполнить("Автосервис.ЗаполнитьДанныеПоЗапланированнымТОВФоне");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписьЗначенияРегистраСведения(Автомобиль, Объект) Экспорт
	
	Если ЗначениеЗаполнено(Объект.Дата) Тогда
		ДатаЗаписи = Объект.Дата;
	Иначе
		ДатаЗаписи = ТекущаяДатаСеанса();
	КонецЕсли;
	
	// Значение параметра изменилось
	ЗаписьРегСведений = РегистрыСведений.ЗапланированныеТО.СоздатьМенеджерЗаписи();
	ЗаписьРегСведений.Период                 = ДатаЗаписи;
	ЗаписьРегСведений.Автомобиль             = Автомобиль;
	ЗаписьРегСведений.ПробегСледующегоТО     = Объект.ПробегСледующегоТО;
	ЗаписьРегСведений.ДатаСледующегоТО       = Объект.ДатаСледующегоТО;
	ЗаписьРегСведений.Автор                  = Пользователи.АвторизованныйПользователь();
	ЗаписьРегСведений.Источник               = Объект.Ссылка;
	ЗаписьРегСведений.ПредставлениеИсточника = Строка(Объект.Ссылка);
	
	Попытка
		ЗаписьРегСведений.Записать(Истина);
	Исключение
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Ошибка записи в регистр ""ЗапланированныеТО""'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,
			,
			Объект.Ссылка,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()),
			РежимТранзакцииЗаписиЖурналаРегистрации.Транзакционная
		);
	КонецПопытки;
	
КонецПроцедуры

Процедура ЧтениеЗначенияРегистраСведения(Автомобиль, ЭтотОбъект) Экспорт
	
	ЭтотОбъект.ПробегСледующегоТО = 0;
	ЭтотОбъект.ДатаСледующегоТО = Дата(1, 1, 1);
	
	Если Не ЗначениеЗаполнено(Автомобиль) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗапланированныеТОСрезПоследних.ПробегСледующегоТО КАК ПробегСледующегоТО,
	|	ЗапланированныеТОСрезПоследних.ДатаСледующегоТО КАК ДатаСледующегоТО,
	|	ЗапланированныеТОСрезПоследних.Автомобиль КАК Автомобиль
	|ИЗ
	|	РегистрСведений.ЗапланированныеТО.СрезПоследних КАК ЗапланированныеТОСрезПоследних
	|ГДЕ
	|	ЗапланированныеТОСрезПоследних.Автомобиль = &Автомобиль";
	
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		
		ЭтотОбъект.ПробегСледующегоТО = ВыборкаДетальныеЗаписи.ПробегСледующегоТО;
		ЭтотОбъект.ДатаСледующегоТО = ВыборкаДетальныеЗаписи.ДатаСледующегоТО;
		
	КонецЕсли;
	
КонецПроцедуры

#Область ПараметрыОбработкиРеквизитовОбъекта

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты регистра
	ОбязательныеРеквизиты = ОбработкаСобытийРегистраСервер.ПолучитьСтандартныеОбязательныеРеквизиты(Объект);
	ОбязательныеРеквизиты.Добавить("ДатаСледующегоТО");
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов.
//  Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Структура уникальных реквизитов
	УникальныеРеквизиты = Новый Структура();
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

#КонецОбласти

#КонецОбласти

#КонецЕсли
